# GetFilters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetFilters Method
ScheduleDefinition Class See Also
---
Gets all filters in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ScheduleFilter> GetFilters()
```

Visual Basic
---
```text
Public Function GetFilters As IList(Of ScheduleFilter)
```

Visual C++
---
```text
public:
IList<ScheduleFilter^>^ GetFilters()
```

# ### Return Value
A list of all filters.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace